# Color Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..Color Property
TextNode Class See Also
---
The color of the text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Color Color { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Color As Color
	Get
```

Visual C++
---
```text
public:
property Color^ Color {
	Color^ get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace